Revit 2027 API
ElementPhaseStatusFilter.PhaseId Property
 The phase id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PhaseId { get; }
Public ReadOnly Property PhaseId As ElementId
	Get
public:
property ElementId^ PhaseId {
	ElementId^ get ();
}
member PhaseId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace